logs/01_19/new/16_52_t1/t1_benchmark_updaterandom.t1.s0.log
RocksDB:    version 6.4
Date:       Tue Jan 19 21:11:28 2021
CPU:        12 * Intel(R) Core(TM) i7-8700 CPU @ 3.20GHz
CPUCache:   12288 KB

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      8/8   293.49 MB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     67.8      0.51              0.00         1    0.510       0      0
  L1     10/5    1.07 GB   1.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L2     39/17   4.13 GB   0.6      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L3     62/0    6.75 GB   0.2      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum    119/30  12.24 GB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     67.8      0.51              0.00         1    0.510       0      0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
User      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0     67.8      0.51              0.00         1    0.510       0      0
Uptime(secs): 3.1 total, 2.0 interval
Flush(GB): cumulative 0.034, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.03 GB write, 11.15 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.5 seconds
Interval compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 3.1 total, 2.0 interval
Cumulative writes: 77K writes, 77K keys, 77K commit groups, 1.0 writes per commit group, ingest: 0.03 GB, 10.31 MB/s
Cumulative WAL: 77K writes, 0 syncs, 77000.00 writes per sync, written: 0.03 GB, 10.31 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 77K writes, 77K keys, 77K commit groups, 1.0 writes per commit group, ingest: 32.02 MB, 15.83 MB/s
Interval WAL: 77K writes, 0 syncs, 77000.00 writes per sync, written: 0.03 MB, 15.83 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      1/0   70.87 MB   0.2      0.3     0.0      0.3       0.1     -0.2       0.0   3.0     91.5     32.9      3.21              1.98         2    1.603   1650K  1252K
  L1      9/4    1.00 GB   1.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L2     39/16   4.13 GB   0.6      0.2     0.1      0.1       0.1     -0.0       0.0   1.8     51.8     33.2      3.84              3.00         1    3.845   1113K   397K
  L3     62/0    6.75 GB   0.2      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum    111/20  11.95 GB   0.0      0.5     0.1      0.4       0.2     -0.2       0.0   6.7     69.9     33.1      7.05              4.98         3    2.350   2764K  1649K
 Int      0/0    0.00 KB   0.0      0.5     0.1      0.4       0.2     -0.2       0.0 208351414.0     75.3     30.4      6.54              4.98         2    3.271   2764K  1649K

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0      0.5     0.1      0.4       0.2     -0.2       0.0   0.0     75.3     30.4      6.54              4.98         2    3.271   2764K  1649K
User      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0     67.8      0.51              0.00         1    0.510       0      0
Uptime(secs): 5.1 total, 2.0 interval
Flush(GB): cumulative 0.034, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.23 GB write, 45.70 MB/s write, 0.48 GB read, 96.47 MB/s read, 7.1 seconds
Interval compaction: 0.19 GB write, 99.29 MB/s write, 0.48 GB read, 246.12 MB/s read, 6.5 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 5.1 total, 2.0 interval
Cumulative writes: 210K writes, 210K keys, 210K commit groups, 1.0 writes per commit group, ingest: 0.09 GB, 17.10 MB/s
Cumulative WAL: 210K writes, 0 syncs, 210000.00 writes per sync, written: 0.09 GB, 17.10 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 133K writes, 133K keys, 133K commit groups, 1.0 writes per commit group, ingest: 55.30 MB, 27.63 MB/s
Interval WAL: 133K writes, 0 syncs, 133000.00 writes per sync, written: 0.05 MB, 27.63 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent

Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     400 bytes each (200 bytes after compression)
Entries:    400000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    160.2 MB (estimated)
FileSize:   83.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: ZSTD
Compression sampling rate: 0
Memtablerep: skip_list
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
DB path: [../data/01_19/new/16_52_t1]
updaterandom :      14.244 micros/op 70204 ops/sec;   56.2 MB/s ( updates:400000 found:400000)
Microseconds per update:
Count: 400000 Average: 14.2442  StdDev: 25.93
Min: 3  Median: 9.2691  Max: 10042
Percentiles: P50: 9.27 P75: 13.92 P99: 81.69 P99.9: 159.68 P99.99: 235.00
------------------------------------------------------
(       2,       3 ]        1   0.000%   0.000% 
(       3,       4 ]      485   0.121%   0.121% 
(       4,       6 ]    45114  11.279%  11.400% ##
(       6,      10 ]   188918  47.230%  58.630% #########
(      10,      15 ]    83596  20.899%  79.529% ####
(      15,      22 ]    31381   7.845%  87.374% ##
(      22,      34 ]    18627   4.657%  92.031% #
(      34,      51 ]    21591   5.398%  97.428% #
(      51,      76 ]     5774   1.444%  98.872% 
(      76,     110 ]     3068   0.767%  99.639% 
(     110,     170 ]     1262   0.316%  99.954% 
(     170,     250 ]      176   0.044%  99.998% 
(     250,     380 ]        3   0.001%  99.999% 
(    2900,    4400 ]        1   0.000%  99.999% 
(    4400,    6600 ]        2   0.001% 100.000% 
(    9900,   14000 ]        1   0.000% 100.000% 

RocksDB:    version 6.4
Date:       Tue Jan 19 21:11:56 2021
CPU:        12 * Intel(R) Core(TM) i7-8700 CPU @ 3.20GHz
CPUCache:   12288 KB

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      3/0   124.61 MB   0.8      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     68.7      0.25              0.00         1    0.250       0      0
  L1      9/1    1.00 GB   1.8      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L2     39/3    4.13 GB   1.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L3     62/0    6.75 GB   0.2      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum    113/4   12.00 GB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     68.7      0.25              0.00         1    0.250       0      0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
User      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0     68.7      0.25              0.00         1    0.250       0      0
Uptime(secs): 2.5 total, 2.0 interval
Flush(GB): cumulative 0.017, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.02 GB write, 6.75 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.3 seconds
Interval compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 2.5 total, 2.0 interval
Cumulative writes: 179K writes, 179K keys, 179K commit groups, 1.0 writes per commit group, ingest: 0.07 GB, 29.24 MB/s
Cumulative WAL: 179K writes, 0 syncs, 179000.00 writes per sync, written: 0.07 GB, 29.24 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 179K writes, 179K keys, 179K commit groups, 1.0 writes per commit group, ingest: 74.43 MB, 36.63 MB/s
Interval WAL: 179K writes, 0 syncs, 179000.00 writes per sync, written: 0.07 MB, 36.63 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      4/0   161.18 MB   1.0      0.0     0.0      0.0       0.1      0.1       0.0   1.0      0.0     68.4      0.79              0.46         2    0.393       0      0
  L1      9/1    1.00 GB   1.8      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L2     39/3    4.13 GB   1.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L3     62/0    6.75 GB   0.2      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum    114/4   12.04 GB   0.0      0.0     0.0      0.0       0.1      0.1       0.0   1.0      0.0     68.4      0.79              0.46         2    0.393       0      0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     68.3      0.54              0.46         1    0.535       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0     68.3      0.54              0.46         1    0.535       0      0
User      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0     68.7      0.25              0.00         1    0.250       0      0
Uptime(secs): 4.5 total, 2.0 interval
Flush(GB): cumulative 0.052, interval 0.036
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.05 GB write, 11.82 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.8 seconds
Interval compaction: 0.04 GB write, 18.25 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.5 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 4.5 total, 2.0 interval
Cumulative writes: 379K writes, 379K keys, 379K commit groups, 1.0 writes per commit group, ingest: 0.15 GB, 34.64 MB/s
Cumulative WAL: 379K writes, 0 syncs, 379000.00 writes per sync, written: 0.15 GB, 34.64 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 200K writes, 200K keys, 200K commit groups, 1.0 writes per commit group, ingest: 83.16 MB, 41.50 MB/s
Interval WAL: 200K writes, 0 syncs, 200000.00 writes per sync, written: 0.08 MB, 41.50 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent

Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     400 bytes each (200 bytes after compression)
Entries:    400000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    160.2 MB (estimated)
FileSize:   83.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: ZSTD
Compression sampling rate: 0
Memtablerep: skip_list
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
DB path: [../data/01_19/new/16_52_t1]
updaterandom :      10.551 micros/op 94780 ops/sec;   75.9 MB/s ( updates:400000 found:400000)
Microseconds per update:
Count: 400000 Average: 10.5508  StdDev: 11.40
Min: 4  Median: 9.1193  Max: 6054
Percentiles: P50: 9.12 P75: 12.08 P99: 33.92 P99.9: 61.21 P99.99: 74.83
------------------------------------------------------
(       3,       4 ]       36   0.009%   0.009% 
(       4,       6 ]    35838   8.960%   8.969% ##
(       6,      10 ]   210466  52.617%  61.585% ###########
(      10,      15 ]   128756  32.189%  93.774% ######
(      15,      22 ]     8275   2.069%  95.843% 
(      22,      34 ]    12713   3.178%  99.021% #
(      34,      51 ]     3246   0.811%  99.832% 
(      51,      76 ]      661   0.165%  99.998% 
(      76,     110 ]        4   0.001%  99.999% 
(     110,     170 ]        1   0.000%  99.999% 
(     170,     250 ]        2   0.001%  99.999% 
(    1900,    2900 ]        1   0.000% 100.000% 
(    4400,    6600 ]        1   0.000% 100.000% 

RocksDB:    version 6.4
Date:       Tue Jan 19 21:12:04 2021
CPU:        12 * Intel(R) Core(TM) i7-8700 CPU @ 3.20GHz
CPUCache:   12288 KB

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      5/0   178.35 MB   1.2      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     69.5      0.25              0.00         1    0.247       0      0
  L1      9/1    1.00 GB   1.8      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L2     39/3    4.13 GB   1.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L3     62/0    6.75 GB   0.2      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum    115/4   12.06 GB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     69.5      0.25              0.00         1    0.247       0      0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
User      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0     69.5      0.25              0.00         1    0.247       0      0
Uptime(secs): 2.5 total, 2.0 interval
Flush(GB): cumulative 0.017, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.02 GB write, 6.84 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.2 seconds
Interval compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 2.5 total, 2.0 interval
Cumulative writes: 194K writes, 194K keys, 194K commit groups, 1.0 writes per commit group, ingest: 0.08 GB, 32.16 MB/s
Cumulative WAL: 194K writes, 0 syncs, 194000.00 writes per sync, written: 0.08 GB, 32.16 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 194K writes, 194K keys, 194K commit groups, 1.0 writes per commit group, ingest: 80.67 MB, 39.82 MB/s
Interval WAL: 194K writes, 0 syncs, 194000.00 writes per sync, written: 0.08 MB, 39.82 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent

Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     400 bytes each (200 bytes after compression)
Entries:    400000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    160.2 MB (estimated)
FileSize:   83.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: ZSTD
Compression sampling rate: 0
Memtablerep: skip_list
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
DB path: [../data/01_19/new/16_52_t1]
updaterandom :       9.896 micros/op 101050 ops/sec;   81.0 MB/s ( updates:400000 found:400000)
Microseconds per update:
Count: 400000 Average: 9.8961  StdDev: 5.87
Min: 4  Median: 8.4206  Max: 2364
Percentiles: P50: 8.42 P75: 10.26 P99: 33.22 P99.9: 49.52 P99.99: 68.37
------------------------------------------------------
(       3,       4 ]      344   0.086%   0.086% 
(       4,       6 ]    52799  13.200%  13.286% ###
(       6,      10 ]   242682  60.671%  73.956% ############
(      10,      15 ]    79985  19.996%  93.953% ####
(      15,      22 ]    10173   2.543%  96.496% #
(      22,      34 ]    10710   2.678%  99.173% #
(      34,      51 ]     3185   0.796%  99.969% 
(      51,      76 ]      118   0.030%  99.999% 
(      76,     110 ]        2   0.001%  99.999% 
(     170,     250 ]        1   0.000% 100.000% 
(    1900,    2900 ]        1   0.000% 100.000% 

RocksDB:    version 6.4
Date:       Tue Jan 19 21:12:12 2021
CPU:        12 * Intel(R) Core(TM) i7-8700 CPU @ 3.20GHz
CPUCache:   12288 KB

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      7/0   232.09 MB   1.8      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     68.8      0.25              0.00         1    0.249       0      0
  L1      9/1    1.00 GB   1.8      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L2     39/3    4.13 GB   1.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L3     62/0    6.75 GB   0.2      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum    117/4   12.11 GB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     68.8      0.25              0.00         1    0.249       0      0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
User      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0     68.8      0.25              0.00         1    0.249       0      0
Uptime(secs): 2.5 total, 2.0 interval
Flush(GB): cumulative 0.017, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.02 GB write, 6.86 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.2 seconds
Interval compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 2.5 total, 2.0 interval
Cumulative writes: 197K writes, 197K keys, 197K commit groups, 1.0 writes per commit group, ingest: 0.08 GB, 32.73 MB/s
Cumulative WAL: 197K writes, 0 syncs, 197000.00 writes per sync, written: 0.08 GB, 32.73 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 197K writes, 197K keys, 197K commit groups, 1.0 writes per commit group, ingest: 81.91 MB, 40.49 MB/s
Interval WAL: 197K writes, 0 syncs, 197000.00 writes per sync, written: 0.08 MB, 40.49 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      8/8   268.69 MB   0.0      0.0     0.0      0.0       0.1      0.1       0.0   1.0      0.0     63.9      0.84              0.53         2    0.420       0      0
  L1      9/5    1.00 GB   0.9      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L2     39/16   4.13 GB   0.6      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L3     62/0    6.75 GB   0.2      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum    118/29  12.14 GB   0.0      0.0     0.0      0.0       0.1      0.1       0.0   1.0      0.0     63.9      0.84              0.53         2    0.420       0      0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     61.9      0.59              0.53         1    0.591       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0     61.9      0.59              0.53         1    0.591       0      0
User      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0     68.8      0.25              0.00         1    0.249       0      0
Uptime(secs): 4.5 total, 2.0 interval
Flush(GB): cumulative 0.053, interval 0.036
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.05 GB write, 11.93 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.8 seconds
Interval compaction: 0.04 GB write, 18.26 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.6 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 4.5 total, 2.0 interval
Cumulative writes: 393K writes, 393K keys, 393K commit groups, 1.0 writes per commit group, ingest: 0.16 GB, 36.26 MB/s
Cumulative WAL: 393K writes, 0 syncs, 393000.00 writes per sync, written: 0.16 GB, 36.26 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 196K writes, 196K keys, 196K commit groups, 1.0 writes per commit group, ingest: 81.50 MB, 40.65 MB/s
Interval WAL: 196K writes, 0 syncs, 196000.00 writes per sync, written: 0.08 MB, 40.65 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent

Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     400 bytes each (200 bytes after compression)
Entries:    400000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    160.2 MB (estimated)
FileSize:   83.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: ZSTD
Compression sampling rate: 0
Memtablerep: skip_list
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
DB path: [../data/01_19/new/16_52_t1]
updaterandom :      10.262 micros/op 97443 ops/sec;   78.1 MB/s ( updates:400000 found:400000)
Microseconds per update:
Count: 400000 Average: 10.2625  StdDev: 6.89
Min: 3  Median: 8.4056  Max: 2506
Percentiles: P50: 8.41 P75: 10.42 P99: 41.28 P99.9: 50.17 P99.99: 62.61
------------------------------------------------------
(       2,       3 ]        2   0.001%   0.001% 
(       3,       4 ]      734   0.183%   0.184% 
(       4,       6 ]    57835  14.459%  14.643% ###
(       6,      10 ]   235166  58.791%  73.434% ############
(      10,      15 ]    74338  18.585%  92.019% ####
(      15,      22 ]    11839   2.960%  94.978% #
(      22,      34 ]    13142   3.285%  98.264% #
(      34,      51 ]     6878   1.720%  99.984% 
(      51,      76 ]       56   0.014%  99.998% 
(      76,     110 ]        6   0.002%  99.999% 
(     110,     170 ]        1   0.000%  99.999% 
(     170,     250 ]        1   0.000%  99.999% 
(     380,     580 ]        1   0.000% 100.000% 
(    1900,    2900 ]        1   0.000% 100.000% 

RocksDB:    version 6.4
Date:       Tue Jan 19 21:12:20 2021
CPU:        12 * Intel(R) Core(TM) i7-8700 CPU @ 3.20GHz
CPUCache:   12288 KB

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      9/9   285.89 MB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     62.7      0.27              0.00         1    0.274       0      0
  L1      9/5    1.00 GB   0.9      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L2     39/16   4.13 GB   0.6      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L3     62/0    6.75 GB   0.2      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum    119/30  12.16 GB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     62.7      0.27              0.00         1    0.274       0      0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
User      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0     62.7      0.27              0.00         1    0.274       0      0
Uptime(secs): 2.6 total, 2.0 interval
Flush(GB): cumulative 0.017, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.02 GB write, 6.72 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.3 seconds
Interval compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 2.6 total, 2.0 interval
Cumulative writes: 153K writes, 153K keys, 153K commit groups, 1.0 writes per commit group, ingest: 0.06 GB, 24.85 MB/s
Cumulative WAL: 153K writes, 0 syncs, 153000.00 writes per sync, written: 0.06 GB, 24.85 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 153K writes, 153K keys, 153K commit groups, 1.0 writes per commit group, ingest: 63.62 MB, 31.39 MB/s
Interval WAL: 153K writes, 0 syncs, 153000.00 writes per sync, written: 0.06 MB, 31.39 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     62.7      0.27              0.00         1    0.274       0      0
  L1     10/4    1.07 GB   1.1      0.3     0.3      0.0       0.1      0.1       0.0   0.4    113.1     40.4      2.95              3.16         1    2.954   1878K  1208K
  L2     39/16   4.13 GB   0.6      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L3     62/0    6.75 GB   0.2      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum    111/20  11.95 GB   0.0      0.3     0.3      0.0       0.1      0.1       0.0   7.9    103.5     42.3      3.23              3.16         2    1.614   1878K  1208K
 Int      0/0    0.00 KB   0.0      0.3     0.3      0.0       0.1      0.1       0.0 125067557.0    113.1     40.4      2.95              3.16         1    2.954   1878K  1208K

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0      0.3     0.3      0.0       0.1      0.1       0.0   0.0    113.1     40.4      2.95              3.16         1    2.954   1878K  1208K
User      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0     62.7      0.27              0.00         1    0.274       0      0
Uptime(secs): 4.6 total, 2.0 interval
Flush(GB): cumulative 0.017, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.13 GB write, 29.92 MB/s write, 0.33 GB read, 73.26 MB/s read, 3.2 seconds
Interval compaction: 0.12 GB write, 59.60 MB/s write, 0.33 GB read, 166.98 MB/s read, 3.0 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 4.6 total, 2.0 interval
Cumulative writes: 320K writes, 320K keys, 320K commit groups, 1.0 writes per commit group, ingest: 0.13 GB, 29.17 MB/s
Cumulative WAL: 320K writes, 0 syncs, 320000.00 writes per sync, written: 0.13 GB, 29.17 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 167K writes, 167K keys, 167K commit groups, 1.0 writes per commit group, ingest: 69.44 MB, 34.70 MB/s
Interval WAL: 167K writes, 0 syncs, 167000.00 writes per sync, written: 0.07 MB, 34.70 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent

Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     400 bytes each (200 bytes after compression)
Entries:    400000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    160.2 MB (estimated)
FileSize:   83.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: ZSTD
Compression sampling rate: 0
Memtablerep: skip_list
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
DB path: [../data/01_19/new/16_52_t1]
updaterandom :      12.515 micros/op 79903 ops/sec;   64.0 MB/s ( updates:400000 found:400000)
Microseconds per update:
Count: 400000 Average: 12.5152  StdDev: 43.37
Min: 4  Median: 9.9924  Max: 23731
Percentiles: P50: 9.99 P75: 14.34 P99: 42.71 P99.9: 50.44 P99.99: 72.27
------------------------------------------------------
(       3,       4 ]      311   0.078%   0.078% 
(       4,       6 ]    36605   9.151%   9.229% ##
(       6,      10 ]   163394  40.849%  50.078% ########
(      10,      15 ]   114824  28.706%  78.784% ######
(      15,      22 ]    47753  11.938%  90.722% ##
(      22,      34 ]    29057   7.264%  97.986% #
(      34,      51 ]     7919   1.980%  99.966% 
(      51,      76 ]      114   0.029%  99.994% 
(      76,     110 ]       14   0.004%  99.998% 
(     110,     170 ]        4   0.001%  99.999% 
(     170,     250 ]        1   0.000%  99.999% 
(    1900,    2900 ]        1   0.000%  99.999% 
(    4400,    6600 ]        1   0.000%  99.999% 
(    9900,   14000 ]        1   0.000% 100.000% 
(   22000,   33000 ]        1   0.000% 100.000%